# St7GetNumLoadPathTemplatePointForces

Returns the number of point forces assigned to the specified load path template.

long St7GetNumLoadPathTemplatePointForces(long uID, long TemplateID,

long Vehicle, long* NumPointForces)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Vehicle

Vehicle number.

Output Parameters

NumPointForces

Number of point forces.